In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

# Player Count

In [2]:
# Find count of unique SN
player_count = purchase_data["SN"].nunique()

In [3]:
# Create new dataframe
total_players_df = pd.DataFrame({"Total Players": [player_count]})

In [4]:
# Dispaly dataframe
total_players_df

   Total Players
0            576

# Purchasing Analysis (Total)

In [5]:
# Find count of unique items
unique_items = purchase_data["Item Name"].nunique()

In [6]:
# Find average price of all items
average_price = purchase_data["Price"].mean()

In [7]:
# Find count of purchases
number_of_purchases = purchase_data["Price"].count()

In [8]:
# Find sum of all purchases
total_revenue = purchase_data["Price"].sum()

In [9]:
# Create new dataframe
purchase_summary_df = pd.DataFrame({"Number of Unique Items": [unique_items],
                                    "Average Price" : [average_price],
                                    "Number of Purchases": [number_of_purchases],
                                    "Total Revenue": [total_revenue]
                                   })

In [10]:
# Format currency values
purchase_summary_df["Average Price"] = purchase_summary_df["Average Price"].map("${:.2f}".format)
purchase_summary_df["Total Revenue"] = purchase_summary_df["Total Revenue"].map("${:,.2f}".format)

In [11]:
# Display dataframe
purchase_summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

# Gender Demographics

In [12]:
# Remove duplicate SNs to create new dataframe of unique players and gender
unique_players_df = purchase_data.drop_duplicates(["SN"])

In [13]:
# Find counts for each gender of unique players
gender_count = unique_players_df["Gender"].value_counts()

In [14]:
# Create new dataframe with gender counts and their percentage
gender_count_df = pd.DataFrame({"Total Count": gender_count, "Percentage of Players":gender_count/player_count*100})

In [15]:
# Display gender count dataframe
gender_count_df

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

# Purchasing Analysis (Gender)

In [45]:
# Group by gender
grouped_gender_df = purchase_data.groupby("Gender")

In [50]:
# Find number of unique players in group
players_in_gender_group = grouped_gender_df['SN'].nunique()

In [51]:
# Calculate purchase count, average purchase price, total purchase, and average purchase per unique player
purchase_count = grouped_gender_df["Purchase ID"].count()
avg_purchase_price = grouped_gender_df["Price"].mean()
total_purchase = grouped_gender_df["Price"].sum()
avg_per_person = total_purchase/players_in_gender_group

In [52]:
# Create purchase summary dataframe
purchase_summary_df = pd.DataFrame({"Count":purchase_count,
                                    "Average Purchase Price":avg_purchase_price,
                                    "Total Purchase Value":total_purchase,
                                    "Avg Total Purchase per Person":avg_per_person
                                   })

In [53]:
# Display dataframe
purchase_summary_df

,Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

# Age Demographics

In [20]:
unique_players_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [21]:
# Find highest age in dataframe
highest_age = unique_players_df["Age"].max()

# Create bins for ages with highest_age as upper limit
age_bins = [0,9,14,19,24,29,34,39,highest_age]

# Create names for bins
age_bins_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [31]:
# Slice data, place it into bins, add new column into unique_players_df
unique_players_df["Age Ranges"]= pd.cut(unique_players_df["Age"], age_bins, labels = age_bins_names)

<ipython-input-31-7f36ff0597ce>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  unique_players_df["Age Ranges"]= pd.cut(unique_players_df["Age"], age_bins, labels = age_bins_names)

In [32]:
group_count = unique_players_df["Age Ranges"].value_counts(sort = False)

In [33]:
age_group_percent = group_count/player_count*100

In [34]:
age_group_df = pd.DataFrame({"Total Count":group_count,"Percentage of Players":age_group_percent})

In [35]:
age_group_df

       Total Count  Percentage of Players
<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
40+             12               2.083333

# Purchasing Analysis (Age)

In [36]:
unique_players_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24,20-24

In [42]:
# Add binned age ranges column to purchase_data dataframe
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"], age_bins, labels = age_bins_names)

In [43]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [54]:
# Group by age ranges
grouped_age_df = purchase_data.groupby(["Age Ranges"])

In [55]:
# Find number of unique players in group
players_in_age_group = grouped_age_df['SN'].nunique()

In [57]:
# Find values
purchase_count2 = grouped_age_df["Purchase ID"].count()
avg_purchase_price2 = grouped_age_df["Price"].mean()
total_purchase2 = grouped_age_df["Price"].sum()
avg_per_person2 = total_purchase2/players_in_age_group

In [60]:
age_purchase_summary_df = pd.DataFrame({"Purchase Count":purchase_count2,
                                        "Average Purchase Price":avg_purchase_price2,
                                        "Total Purchase Value":total_purchase2,
                                        "Avg Total Purchase per Person":avg_per_person2  
                                       })

In [61]:
age_purchase_summary_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

# Top Spenders

In [62]:
# Add purchase count column and set to 1
purchase_data["Purchase Count"] = 1

In [63]:
# Group by SN
grouped_sn_df = purchase_data.groupby(['SN'])

In [64]:
# Calculate total purchase value and count
total_purchase = grouped_sn_df['Price'].sum()
purchase_count = grouped_sn_df['Purchase Count'].sum()

In [65]:
# Calculate average purchase price
average_price = total_purchase/purchase_count

In [66]:
# Create new dataframe from grouped data
pg_df = pd.DataFrame({"Count":purchase_count, "Average":average_price, "Price": total_purchase})

In [67]:
# Sort dataframe by descending total purchase
pg_df.sort_values(by=['Price'], inplace=True, ascending = False)

In [68]:
# Display preview
pg_df.head()

             Count   Average  Price
SN
Lisosia93        5  3.792000  18.96
Idastidru52      4  3.862500  15.45
Chamjask73       3  4.610000  13.83
Iral74           4  3.405000  13.62
Iskadarya95      3  4.366667  13.10

# Most Popular Items

In [69]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges,Purchase Count
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24,1
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+,1
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24,1
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24,1
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24,1

In [70]:
# Group
grouped_item_df = purchase_data.groupby(['Item ID', 'Item Name'])

In [71]:
purchase_count = grouped_item_df['Purchase Count'].sum()

In [72]:
item_price = grouped_item_df['Price'].sum()

In [73]:
average_item_price = item_price/purchase_count

In [74]:
popular_items_df = pd.DataFrame({'Purchase Count':purchase_count, 'Item Price':average_item_price, 'Total Purchase Value': item_price})

In [75]:
popular_items_df.sort_values(by = 'Purchase Count', inplace = True, ascending = False)

In [76]:
popular_items_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

# Most Profitable Items

In [77]:
profitable_items_df = popular_items_df.copy()

In [78]:
profitable_items_df.sort_values(by = 'Total Purchase Value', inplace = True, ascending = False)

In [79]:
profitable_items_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80